import numpy as np
# 用于为测试函数二维情况下提供固定的2*2个LHS初始样本


def dataSample(func='branin'):
    if func == 'branin':
        X = np.array([[0.625, 1.875], [-3.125, 9.375], [8.125, 13.125],
                      [4.375, 5.625]])
        Y = np.array([27.90409355, 8.57972118, 140.3274732, 23.7576256])
    else:
        if func == 'rosenbrock':
            X = np.array([[4.375, 9.375], [8.125, 5.625], [-3.125, 1.875],
                          [0.625, 13.125]])
            Y = np.array([68.68529946, 23.65532798, 107.73211284, 82.8998467])
        elif func == 'threeHumpCamel':
            X = np.array([[0.5, -1.5], [-1.5, 1.5], [1.5, -0.5], [-0.5, 0.5]])
            Y = np.array([1.93697917, 1.0828125, 0.5828125, 0.43697917])

    return X, Y
